Tekla.Structures.Model.UI.Picker
The Picker class can be used to query the user to do manual picks of objects and points from the Tekla Structures model.
The methods throw an exception if the user interrupts (cancels) the pick command.
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
using System;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
Point p = null;
try
{
p = Picker.PickPoint();
}
catch (Exception e)
{
MessageBox.Show(e.ToString());
}
}
}
Remarks:
Prompts
Tekla Structures prefixes the given prompt with "prompt_" and
looks for a translation in the prompts.ail file. If the translation
(e.g. "prompt_Pick_first_position") is not found in the prompts.ail
file, the prompt string is displayed as such. This feature can be used to
give already translated strings to the picker.

Tekla.Structures.Model.UI.Picker.#ctor
Creates a new picker instance.

Tekla.Structures.Model.UI.Picker.PickPoint
Queries the user to pick a point from the model.
Returns: The point the user picked.

Tekla.Structures.Model.UI.Picker.PickPoint(System.String)
Queries the user to pick a point from the model with the given prompt.
Prompt: The string to display as user guidance.
Returns: The point the user picked.

Tekla.Structures.Model.UI.Picker.PickPoint(Tekla.Structures.Geometry3d.Point)
Queries the user to pick a point from the model with reference to the given point.
ReferencePoint: The point to be used as reference.
Returns: The point the user picked.

Tekla.Structures.Model.UI.Picker.PickPoint(System.String,Tekla.Structures.Geometry3d.Point)
Queries the user to pick point with given prompt and reference to another point.
Prompt: The string to display as user guidance.
ReferencePoint: The point to be used as reference.
Returns: The point the user picked.

Tekla.Structures.Model.UI.Picker.PickPoints(Tekla.Structures.Model.UI.Picker.PickPointEnum)
Queries the user to pick points from the model.
Enum: Indicates how many points the user must pick.
Returns: A list of points the user picked.

Tekla.Structures.Model.UI.Picker.PickPoints(Tekla.Structures.Model.UI.Picker.PickPointEnum,System.String)
Queries the user to pick points from the model with the given prompt and reference to another point.
Enum: Indicates how many points the user must pick.
Prompt: The string to display as user guidance.
Returns: A list of points the user picked.

Tekla.Structures.Model.UI.Picker.PickLine
Queries the user to pick a line from the model.
Returns: A list of points the user picked.

Tekla.Structures.Model.UI.Picker.PickLine(System.String)
Queries the user to pick a line from the model with the given prompt.
Prompt: The string to display as user guidance.
Returns: A list of points the user picked.

Tekla.Structures.Model.UI.Picker.PickFace
Queries the user to pick a face from the model.
Returns: A list of the vertices of the face and the object the user picked as one PickInput instance.

Tekla.Structures.Model.UI.Picker.PickFace(System.String)
Queries the user to pick a face from the model with the given prompt.
Prompt: The string to display as user guidance.
Returns: A list of the vertices of the face and the object the user picked as one PickInput instance.

Tekla.Structures.Model.UI.Picker.PickObject(Tekla.Structures.Model.UI.Picker.PickObjectEnum)
Queries the user to pick one model object from the model.
Enum: Indicates the type of objects to pick.
Returns: One model object instance.

Tekla.Structures.Model.UI.Picker.PickObject(Tekla.Structures.Model.UI.Picker.PickObjectEnum,System.String)
Queries the user to pick one model object from the model with the given prompt.
Enum: Indicates the type of objects to pick.
Prompt: The string to display as user guidance.
Returns: One model object instance.

Tekla.Structures.Model.UI.Picker.PickObjects(Tekla.Structures.Model.UI.Picker.PickObjectsEnum)
Queries the user to pick model objects from the model.
Enum: Indicates the type and amount of objects to pick.
Returns: An enumerator of model object instances.

Tekla.Structures.Model.UI.Picker.PickObjects(Tekla.Structures.Model.UI.Picker.PickObjectsEnum,System.String)
Queries the user to pick model objects from the model with the given prompt.
Enum: Indicates the type and amount of objects to pick.
Prompt: The string to display as user guidance.
Returns: An enumerator of model object instances.